USE `кинотеатр`;

-- Кинотеатр и залы
INSERT INTO `cinema` (name, address, phone, email, director, accountant, details, inn) VALUES 
('Авангард', '196154, г. Санкт-Петербург, ул. Лесная, д.10', '88126776060', 'AvangardCinema01@mail.ru', 'Сахарова София Андреевна', 'Тельнов Тимофей Александрович', 'р/с 40702810555310000409 в Северо-Западном Банке ПАО «Сбербанк России»', '7821006823');

INSERT INTO `hall_type` (name) VALUES 
('Screen Max'), ('Dolby Atmos'), ('МУВИК'), ('КосМАКС');

INSERT INTO `hall` (cinema_id, hall_type_id, seats) VALUES 
(1, 1, 200), (1, 2, 150), (1, 3, 200), (1, 4, 120), (1, 1, 250);

-- Режиссеры и Жанры
INSERT INTO `director` (name) VALUES 
('Шон Бэйкер'), ('Тим Милантс'), ('Гай Ричи'), ('Хаяо Миядзаки'), ('Ли Анкрич'), ('Алексей Балабанов');

INSERT INTO `genre` (name) VALUES 
('драма'), ('комедия'), ('история'), ('военный'), ('криминал'), ('боевик'), ('триллер'), ('аниме'), ('мультфильм'), ('фэнтези');

-- Фильмы
INSERT INTO `film` (name, year, director_id, duration, description) VALUES 
('Анора', 2024, 1, 138, 'Анора, предпочитающая имя Эни, работает в бруклинском стрип-клубе...'),
('Мелочи жизни', 2024, 2, 98, 'Ирландия, 1985 год. Накануне Рождества огромный упущения...'),
('Никто не должен знать', 2021, 3, 99, 'Фил — крепкий мужчина средних лет, переживающий...'),
('Тайна Коко', 2017, 5, 95, '12-летний Мигель живет в мексиканской деревне...');

-- Привязка жанров к фильмам
INSERT INTO `film_genre` (film_id, genre_id) VALUES 
(1, 1), (1, 2), 
(2, 1),         
(3, 1),        
(4, 9), (4, 10); 

-- Кассиры и Клиенты
INSERT INTO `cashier` (name, phone) VALUES 
('Санникова Алена Александровна', '89040551769'),
('Иванов Иван Иванович', '89990458998'),
('Богданова Наталья Георгиевна', '89883453443');

INSERT INTO `client` (name, phone, email) VALUES 
('Гущин Андрей Михайлович', '89551241213', 'gushinA@mail.ru'),
('Долматова Кристина Владимировна', '89567890089', 'dolmir@yandex.ru'),
('Дроздова Лилия Алексеевна', '89453456765', 'lilikA89@mail.ru');

-- Сеансы и Платежи
INSERT INTO `session` (film_id, hall_id, date, s_time, end_time, status, cashier_id, price) VALUES 
(1, 1, '2025-05-15', '18:30:00', '21:15:00', 'planned', 1, 450.00),
(4, 5, '2025-05-15', '15:40:00', '17:20:00', 'planned', 1, 560.00),
(3, 2, '2025-05-15', '19:00:00', '21:00:00', 'planned', 2, 520.00);

INSERT INTO `payment` (amount, date, status) VALUES 
(450.00, NOW(), 'paid'),
(560.00, NOW(), 'paid');

INSERT INTO `ticket` (session_id, seat, status, date, client_id, cashier_id, payment_id) VALUES 
(1, 12, 'paid', NOW(), 1, 1, 1),
(2, 17, 'paid', NOW(), 2, 1, 2);
